---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.gbXMLOpeningType.FixedSkylight
enum: Autodesk.Revit.DB.Analysis.gbXMLOpeningType
source: html/2b5920b2-fd0a-f3f1-02c1-74c6ce381336.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLOpeningType.FixedSkylight

Fixed skylight.